package com.exam03.strategy;

abstract public class Flaff {
    public static String txt0 ="Каждое утро Лисёнок просыпался, завтракал и шёл увидеться с Бельчонком. Это утро не было" +
            " исключением. Лисёнок пришёл на их обычное место встречи, но Бельчонка там не было. Лисёнок ждал, ждал, но так" +
            " и не смог дождаться своего друга. \"Бельчонок не пропустил еще ни одной встречи, вдруг он попал в беду.\"" +
            " - подумал Лисёнок. Как поступить Лисенку?\n" +
            " 1 -   [[Вернуться домой]]\n" +
            " 2 -   [[Отправиться на поиски]]";
    public static String txt1 ="Вернувшись домой, Лисёнок нашёл там Бельчонка. Оказалось, что Бельчонок пришёл на место" +
            " встречи раньше и увидел там рой злобных пчел. Он поспешил предупредить об этом Лисёнка, но они разминулись." +
            " Наконец-то друзья нашли друг друга! Игра завершилась успехом\n";
    public static String txt2 ="Все лесные жители были заняты своими делами и не обращали внимания на Лисёнка и его проблему. Но вдруг кто нибудь видел Бельчонка... Лисёнок не знал, что ему делать. Помогите ему.\n" +
            " 1 -   [[Попытаться разузнать о Бельчонке у лесных жителей]]\n" +
            " 2 -   [[Искать Бельчонка в одиночку]]";
    public static String txt3="Пока Лисёнок принимал решение, лесные жители разошлись кто куда. Остались только Сова и Волк. Но у Совы бывают проблемы с памятью, а Волк может сильно разозлиться из-за расспросов. Кого выбрать?\n" +
            " 1 -   [[Расспросить Сову]]\n" +
            " 2 -   [[Расспросить Волка]]";
    public static String txt4="Лисёнок слишком долго плутал по лесу в поисках друга и сам не заметил, как заблудился. Теперь его самого нужно искать. Игра завершилась неудачей";
    public static String txt5="Сова долго не хотела говорить, но в итоге сказала, что видела испуганного Бельчонка, бежавшего в глубь леса. Все лесные жители знают, что в глубине леса опасно, если Бельчонок там, ему срочно нужна помощь.\n" +
            " 1   [[Поверить Сове и отправиться в глубь леса]]\n" +
            " 2   [[Сове не стоит верить->Искать Бельчонка в одиночку]]";
    public static String txt6="Волк оказался вполне дружелюбным, но помочь не смог. Лишь сказал, что маленькому лисенку не стоит бродить по лесу одному. И как теперь поступить?\n" +
            " 1   [[Волк прав->Вернуться домой]]\n" +
            " 2   [[Искать Бельчонка в одиночку]]";
    public static String txt7="В глубине леса Лисёнок встретил Медвежонка. Ленивый Медвежонок был готов рассказать все, что знает, если Лисёнок принесёт ему мёда.\n" +
            " 1   [[Нет, потрачено слишком много времени, нужно идти дальше->Искать Бельчонка в одиночку]]\n" +
            " 2   [[Нужно воспользоваться шансом и раздобыть мёд]]";
    public static String txt8="Лисёнок быстро нашёл мёд, но вокруг летал рой злобных пчел. Лисёнок всегда боялся пчёл, но и не найти друга он тоже боялся.\n" +
            " 1   [[Подождать, вдруг пчёлы улетят]]\n" +
            " 2   [[Нужно попытаться выкрасть мёд немедленно]]";
    public static String txt9="Лисёнок подождал немного, и пчёлы разлетелись. Лисёнок без проблем набрал мёда. Вдруг он понял, что очень голоден. Что же делать?\n" +
            " 1   [[Поесть немного и передохнуть]]\n" +
            " 2   [[Скорее отнести мёд Медвежонку]]";
    public static String txt10="Это была не лучшая идея. Пчёлы покусали Лисёнка, теперь ему самому нужна помощь. Игра закончилась неудачей";
    public static String txt11="Пока Лисёнок ел, злобные пчёлы вернулись и покусали его. Лисёнку нужна помощь, он не сможет продолжить поиски. Игра завершилась неудачей";
    public static String txt12="Довольный Медвежонок рассказал Лисёнку, что очень хорошо знает семью Белок и уверен, что Бельчонок никогда не пошёл бы в глубь леса. Он заверял Лисёнка, что Белки не попадают в неприятности, и что Совам нельзя верить, он также уговаривал Лисёнка вернуться домой.\n" +
            " 1   [[Межвежонок ничего не знает, нужно продолжить поиски->Искать Бельчонка в одиночку]]\n" +
            " 2  [[Может быть он прав и Лисёнок просто паникует->Вернуться домой]]";
    public static String txt13 ="Победа";


}
